#include "s21_graph_algorithms.h"

int	main()
{
/*
Необходимо написать основную программу, которая представляет из себя консольное приложение для проверки работоспособности реализованных библиотек s21_graph.h и s21_graph_algorithms.h
Консольный интерфейс обязательно должен покрывать следующий функционал:

1 загрузка исходного графа из файла
2 обход графа в ширину с выводом результата обхода в консоль
3 обход графа в глубину с выводом результата обхода в консоль
4 поиск кратчайшего пути между произвольными двумя вершинами с выводом результата в консоль
5 поиск кратчайших путей между всеми парами вершин в графе с выводом результирующей матрицы в консоль
6 поиск минимального остовного дерева в графе с выводом результирующей матрицы смежности в консоль
7 решение задачи комивояжера с выводом результирующего маршрута и его длины в консоль

Добавить в консольный интерфейс возможность проведения сравнительного исследования скорости работы трёх алгоритмов (муравьиного алгоритма и двух выбранных произвольно)

1 Исследование запускается для графа, который был предварительно загружен из файла.
2 В рамках исследования требуется засечь время, потраченное на решение задачи коммивояжера N раз подряд, каждым из алгоритмов. Где N задаётся с клавиатуры.
3 Необходимо вывести в консоль результаты замера времени.
*/
}